---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarWorkInstructions.Straight
enum: Autodesk.Revit.DB.Structure.RebarWorkInstructions
source: html/b7a51829-c964-ed2b-6830-d1326d1a6297.htm
---
# Autodesk.Revit.DB.Structure.RebarWorkInstructions.Straight

The bar will be delivered as a straight bar to the site and the shape code is one of the straight Rebar Shapes loaded into the project (e.g. 00).